app/controllers/api/positions_controller.rb

INSERT INTO `positions` (`lat`, `long`, `name`, `mail`, `created_at`, `updated_at`) VALUES (35.6121073058207, 139.15611539049, 'hoge', 'hoge', '2016-03-15 16:15:02', '2016-03-15 16:15:02')
---
  def create
    position = Position.new(create_params)
    unless position.save

SELECT  `positions`.* FROM `positions`  ORDER BY created_at DESC LIMIT 1
SELECT `positions`.`lat` FROM `positions`  ORDER BY created_at DESC
SELECT `positions`.`long` FROM `positions`  ORDER BY created_at DESC
---
  def map
    # unless
    @points = Position.all.limit('1').order('created_at DESC')
    @hash = Gmaps4rails.build_markers(@points) do |position, marker|
      marker.lat position.lat
      marker.lng position.long
    end
    y = Position.order('created_at DESC').pluck(:lat)[0]
    x = Position.order('created_at DESC').pluck(:long)[0]