app/controllers/api/positions_controller.rb

  def create
    user = User.new(create_params)
    unless user.save
---
INSERT INTO `users` (`lat`, `long`, `name`, `mail`, `pin`, `created_at`, `updated_at`) VALUES (35.6180010203024, 139.142666015441, '松井達夢', 'a8@gmail.com', '1234', '2016-03-15 18:41:25', '2016-03-15 18:41:25')

  def map
    # unless
    @points = User.all.limit('1').order('created_at DESC')
    @hash = Gmaps4rails.build_markers(@points) do |position, marker|
      marker.lat position.lat
      marker.lng position.long
    end
    y = User.order('created_at DESC').pluck(:lat)[0]
    x = User.order('created_at DESC').pluck(:long)[0]
---
SELECT  `users`.* FROM `users`  ORDER BY created_at DESC LIMIT 1
SELECT `users`.`lat` FROM `users`  ORDER BY created_at DESC
SELECT `users`.`long` FROM `users`  ORDER BY created_at DESC