app/controllers/sessions_controller.rb

  def new
    user = User.find_by_mail(params[:mail])
---
SELECT  `users`.* FROM `users` WHERE `users`.`mail` = 'a7@gmail.com' LIMIT 1